progress.org
#+setupfile: info/index-bigblow-header.setup
#+include: info/common-header.org
#+title: 2022年の講義の進行

* 確率と確率空間
** 1.1 標本空間と事象
-  確率における標本空間と事象に関する言葉の定義，
   その定義を，集合の言葉での解釈する
   - 標本空間 :: すべての根源事象の集合
   - 事象 :: 標本空間の部分集合

** 1.2 確率の定義
- P(A)
-  事象の生起確率 = |事象集合|/|全事象集合|， |集合| は集合の濃度。

** 1.3 確率の性質
- 確率の公理
- 排反な事象

** 1.4 条件付確率
- $P(B|A) = P(A) P(B \cup A)$
      
** 1.5 独立性
- $P(B) = P(B|A)$ なら独立， 事象A と 事象B は無関係
      
** 1.6 ベイズの定理
- $P(B_i|A) = \frac{P(A \cap B_i)}{P(A)}$
  - $P(A\cap B_i) = P(B_i) P(A|B_i)$
  - $P(A) = \Sigma_{1}^{n} P(B_i) P(A|B_i)$ 
      
** 1.7 例
-  くじをひく順番で当る確率が違うのか
-  システム全体の故障率
-  この検査は信頼できるのか

** 1.8 確率空間 とばす，2.9 と一緒に

事象と確率を考える，確率モデル。

 -  標本空間 $\Omega$
 -  事象の集合 A
 -  確率関数 P:A->R

* 確率変数と確率分布

** 2.1　確率変数と確率分布
- 確率変数 (r.v.) X :: random variable
  - 事象に対し，数値を与える，
  - 数値に出現は，確率関数または確率密度関数にしたがう
    
- 確率関数 (p.f.) $f(n)$ :: probability function
  - 離散的な事象の確率を与える関数
    
- 確率密度関数 (p.d.f.) $f(x)$ :: probability density function  
  - 連続的な事象の出現確率を決定するための関数

  - $P(a< X \leq b) = \int_{a}^{b} f(x) dx$

- (累積)分布関数 (c.d.f) $F(x)$:: cummulative distribution function
  - $F(x) = P(X \leq x)  = \int_{-\infty}^{x} f(t) dt$
  - $f(x) = \frac{d F(x)}{dx}$

** 2.2 期待値と平均と分散

確率密度関数を用いた統計値の計算について:    

- 平均値と期待値と線形変換
- 分散と線形変換
- 標準偏差
- 標準化
            
- g(X)の期待値: 試行における，確率変数による式 g(X) の平均値

-  平均 == X の期待値 = E[X] = μ
-  分散 == (X-E[X])2 = V[X] = E[x2]-E[X]2 = σ2

** 2.9　確率変数と確率分布と確率空間 
    (Ω, A, P) の三つ組
   

* いろいろな確率分布
** 3.1 離散型確率分布
    - 一様分布
    - ベルヌーイ分布
    - 二項分布

      \( _nC_k p^k (1-p)^{(n-k)} \)

   - ポアソン分布

     \( \frac{\lambda^k}{k!}e^{-\lambda} \)

** 3.2 連続型確率分布

     - 一様分布

     - 指数分布

       \( P(X > x+y ) = P(X>x) \times P(X>y) \) 

     - 指数分布の分布関数

** 3.2 連続型確率分布

     - 正規分布

     - ガンマ分布 (多次元分布の学習後)
     - カイ二乗分布とt-分布 (多次元分布の学習後)


** 3.4 確率分布の平均と分散

** 3.6　モーメント母関数

     分布関数をユニークに特徴付ける表現

     - 母関数という考え方
       - N-次モーメントを係数にもつべき級数にクローズド形が存在すると，
       - それはクローズド形マクローリン展開と考えられる
       - N-次モーメントは，N-次微分によって得られる


* 確率変数と確率分布 (多次元)

** 2.3 多次元確率変数と同時確率分布と周辺確率分布
 -  多次元分布の記述の定義

** 2.4 多次元確率変数の特性値
- 平均
- 分散
- 共分散
- 相関係数

** 2.5 確率変数の独立性

- 変数毎の1変数関数の積になるということ
- 独立なら無相関
- 独立なら共分散は0

** 2.6 確率変数の和の平均と分散

** 2.7 確率変数の条件付確率分布

 -  f(x,y)と x=x0 の曲線

** 2.8 確率とモーメントに関連した不等式

 -  Chebyshevの不等式

    -  平均との差がeとなる確率
    -  

       #+BEGIN_QUOTE
         分散/e**2
       #+END_QUOTE

 -  Cauchy-Schwartz

    -  分散積>=共分散の積

 -  Jensen

    -  下に凸な関数 h(x)
    -  E[h(X)] >= h(E[X])

** 2.4 多次元確率変数の特性値
- 平均
- 分散
- 共分散
- 相関係数

** 2.5 確率変数の独立性
- 変数毎の1変数関数の積になるということ
- 独立なら無相関
- 独立なら共分散は0

** 2.6 確率変数の和の平均と分散

** 2.7 確率変数の条件付確率分布
- f_x(x) のグラフ
- f_y(y) のグラフ
- X と Y が独立なときの f(x, y) = f_x(x)\times f_y(y) のグラフ
- x=x0 の曲線 f(x0, y) X=x0 の条件

* いろいろな確率分布
** 3.3 多次元確率分布
- 多項分布
- 多次元正規分布

** 3.4 確率分布の平均と分散

    - 講義予定
      - 7/22 多次元分布関数，確率変数の変数変換 
      - 7/29 確率変数の変数変換 
      - 8/5  確率変数の変数変換 


   - 4章変数変換 [[https://drive.google.com/drive/folders/1Aal90038yMW8gjCoLj8uMb_WOxPmVbIk][stat2_06_1107 - Google ドライブ]]
   - 4章変数変換 [[https://drive.google.com/drive/folders/1FZiAWpoZaU0kBdA77XnbYqfpNFZOqLWJ][stat2_07_1122 - Google ドライブ]]
   - 4章変数変換[[https://drive.google.com/drive/folders/1cyqJjwz7PbMWrIkHWAH9jfs6uw8ynXBt][ stat2_08_1129 - Google ドライブ]]

** 3.5 多次元正規分布の性質
- 周辺確率分布の計算

  他の確率変数に関して，全域で部分積分すること
  
- 多次元分布関数のグラフによる理解
  - 同時確率密度関数のグラフ
  - 同時確率密度関数のグラフと周辺確率密度関数のグラフ
  - 条件付確率密度関数のグラフ

- 独立性が積となることの確認

- 2次元正規分布について，指数関数のべき乗部の二次式について
  - 正定値対象行列 [[https://www.or.mist.i.u-tokyo.ac.jp/kanno/lecture/math_design/psd170420.pdf][psd170420.pdf]]
  [[https://mathtrain.jp/quadraticform][- 二次形式の意味，微分，標準形など | 高校数学の美しい物語]]
  - x^2+y^2 なら X と Y は独立
  - 平行移動 $ (x-mu_x)^2+(y-\mu_y)^2 $ なら X と Y は独立

   - $ (2(x+y)^2+(x-y)^2) $ なら X と Y は独立ではない
     3x^2 + 2xy + 3y^2 
     Sigma = [3, 1]
             [1, 3]

* 確率変数の変数変換

** 4.1 線形変換された確率変数の確率分布
- 線形変換 前回は，線形変換の立場から，確率変数の変数の
- 一般の1変数の変数変換
  - 合成関数
  - 多変数の変数変換
    - $ \vec{\vec{Y}} = \vec{g}(\vec{X}) = [g_i(\vec{X})] $
	 g_i は多変数関数: R^n -> R

    - $ \vec{g} の 微小変化 (ヤコビ行列) $
      - [[https://mathtrain.jp/jacobian][ヤコビ行列，ヤコビアンの定義と極座標の例 | 高校数学の美しい物語]]
      - [[https://ja.wikipedia.org/wiki/%E3%83%A4%E3%82%B3%E3%83%93%E8%A1%8C%E5%88%97][ヤコビ行列 - Wikipedia]]
      - 変換の大きさ
      - 微小変化の体積
      - [[https://ja.wikipedia.org/wiki/%E8%A1%8C%E5%88%97%E5%BC%8F][行列式 - Wikipedia]]
- 確率分布の変数変換
  1. P(a<X<b) = P(g(a)<Y<g(b))
  2. F_x(a, b) = int(f_(x), a, b) = int(f_y(x), g(a), g(b)) =
     F_y(g(a), g(b))
  3. f_x(x) dx = f_y(y) dy

** 4.1 線形変換された確率変数の確率分布

     - 確率分布の変数変換

       1. P(a<X<b) = P(g(a)<Y<g(b))
       2. F_x(a, b) = int(f_(x), a, b) = \int(f_y(x), g(a), g(b)) =
          F_y(g(a), g(b))
       3. f_x(x) dx = f_y(y) dy

     $ Y = X^2 $, $ X ~ N(0,1) $, 
   
     \( Y = \sum_n X_i^2, X_i ~ N(0,1) \)

     - [[https://ja.wikipedia.org/wiki/%E3%82%AB%E3%82%A4%E4%BA%8C%E4%B9%97%E5%88%86%E5%B8%83][カイ二乗分布 - Wikipedia]]
     - [[https://bellcurve.jp/statistics/course/9208.html][22-1. カイ二乗分布 | 統計学の時間 | 統計WEB]]

     - ガンマ分布，カイ二乗分布 [[https://drive.google.com/drive/u/0/folders/1zxoKIR5XoHI6HyDjCozhgq2UKeOV234g][lect-note - Google ドライブ]]

     - [[https://mathtrain.jp/gamma][ガンマ関数（階乗の一般化）の定義と性質 | 高校数学の美しい物語]]

     - [[https://mathtrain.jp/chisquare][正規分布の二乗和がカイ二乗分布に従うことの証明 | 高校数学の美しい物語]]

** 4.2 独立な確率変数の和の確率分布

** 4.3 確率変数の最大値と最小値の確率分布

** 4.4 変数変換された連続型確率変数の確率分布


  
* 14回目 期末テスト
